[Killed] ConditionalExpression
src/provisioning.js:12:7
   } = claims;
 
   // 1. Enforce Email Verification
-  if (email_verified === false) {
+  if (true) {
     throw new Error("Email must be verified by OAuth provider");
   }
killedBy: All tests
statusReason: > auth-test-lab@1.0.0 test
> node --experimental-vm-modules node_modules/.bin/jest --coverage


(node:1961) ExperimentalWarning: VM Modules is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

FAIL tests/provisioning.test.js

[Killed] BooleanLiteral
src/provisioning.js:12:26
   } = claims;
 
   // 1. Enforce Email Verification
-  if (email_verified === false) {
+  if (email_verified === true) {
     throw new Error("Email must be verified by OAuth provider");
   }
killedBy: All tests
statusReason: > auth-test-lab@1.0.0 test
> node --experimental-vm-modules node_modules/.bin/jest --coverage


(node:2042) ExperimentalWarning: VM Modules is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

FAIL tests/provisioning.test.js

[Killed] ConditionalExpression
src/provisioning.js:17:7
   }
 
   // 2. Enforce Domain/Tenant Restrictions (if configured)
-  if (config.allowedDomains && !config.allowedDomains.includes(hd)) {
+  if (true) {
     throw new Error("Domain not authorized");
   }
killedBy: All tests
statusReason: > auth-test-lab@1.0.0 test
> node --experimental-vm-modules node_modules/.bin/jest --coverage


(node:2123) ExperimentalWarning: VM Modules is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

FAIL tests/provisioning.test.js

[Killed] BooleanLiteral
src/provisioning.js:17:32
   }
 
   // 2. Enforce Domain/Tenant Restrictions (if configured)
-  if (config.allowedDomains && !config.allowedDomains.includes(hd)) {
+  if (config.allowedDomains && config.allowedDomains.includes(hd)) {
     throw new Error("Domain not authorized");
   }
killedBy: All tests
statusReason: > auth-test-lab@1.0.0 test
> node --experimental-vm-modules node_modules/.bin/jest --coverage


(node:2204) ExperimentalWarning: VM Modules is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

FAIL tests/provisioning.test.js

[Killed] StringLiteral
src/provisioning.js:18:21
 
   // 2. Enforce Domain/Tenant Restrictions (if configured)
   if (config.allowedDomains && !config.allowedDomains.includes(hd)) {
-    throw new Error("Domain not authorized");
+    throw new Error("");
   }
 
killedBy: All tests
statusReason: > auth-test-lab@1.0.0 test
> node --experimental-vm-modules node_modules/.bin/jest --coverage


(node:2258) ExperimentalWarning: VM Modules is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

FAIL tests/provisioning.test.js

[Killed] LogicalOperator
src/provisioning.js:22:33
   }
 
   // 3. Reliable Matching (Email/Provider ID rules)
-  let user = database.find(u => u.providerId === sub || u.email === email);
+  let user = database.find(u => u.providerId === sub && u.email === email);
 
   if (user) {
killedBy: All tests
statusReason: > auth-test-lab@1.0.0 test
> node --experimental-vm-modules node_modules/.bin/jest --coverage


(node:2366) ExperimentalWarning: VM Modules is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

FAIL tests/provisioning.test.js

[Killed] EqualityOperator
src/provisioning.js:22:57
   }
 
   // 3. Reliable Matching (Email/Provider ID rules)
-  let user = database.find(u => u.providerId === sub || u.email === email);
+  let user = database.find(u => u.providerId === sub || u.email !== email);
 
   if (user) {
killedBy: All tests
statusReason: > auth-test-lab@1.0.0 test
> node --experimental-vm-modules node_modules/.bin/jest --coverage


(node:2474) ExperimentalWarning: VM Modules is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

FAIL tests/provisioning.test.js

[Killed] BlockStatement
src/provisioning.js:24:13
   // 3. Reliable Matching (Email/Provider ID rules)
   let user = database.find(u => u.providerId === sub || u.email === email);
 
-  if (user) {
-    // 4. Update existing profile fields
-    user.name = name;
-    user.profileImage = picture;
-    user.isNewUser = false; // Existing user matched
-  } else {
+  if (user) {} else {
     // 5. Provision New User with correct default role (Candidate)
     user = {
killedBy: All tests
statusReason: > auth-test-lab@1.0.0 test
> node --experimental-vm-modules node_modules/.bin/jest --coverage


(node:2555) ExperimentalWarning: VM Modules is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

FAIL tests/provisioning.test.js

[Killed] BooleanLiteral
src/provisioning.js:28:22
     // 4. Update existing profile fields
     user.name = name;
     user.profileImage = picture;
-    user.isNewUser = false; // Existing user matched
+    user.isNewUser = true; // Existing user matched
   } else {
     // 5. Provision New User with correct default role (Candidate)
killedBy: All tests
statusReason: > auth-test-lab@1.0.0 test
> node --experimental-vm-modules node_modules/.bin/jest --coverage


(node:2582) ExperimentalWarning: VM Modules is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

FAIL tests/provisioning.test.js

[Killed] BlockStatement
src/provisioning.js:29:10
     user.name = name;
     user.profileImage = picture;
     user.isNewUser = false; // Existing user matched
-  } else {
-    // 5. Provision New User with correct default role (Candidate)
-    user = {
-      id: `user_${Date.now()}`,
-      providerId: sub,
-      email: email,
-      name: name,
-      profileImage: picture,
-      role: config.defaultRole || 'Candidate', // [Requirement: correct default role]
-      isNewUser: true // [Requirement: First-time login onboarding flag]
-    };
-    database.push(user);
-  }
+  } else {}
   return user;
 }
killedBy: All tests
statusReason: > auth-test-lab@1.0.0 test
> node --experimental-vm-modules node_modules/.bin/jest --coverage


(node:2609) ExperimentalWarning: VM Modules is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

FAIL tests/provisioning.test.js

[Killed] LogicalOperator
src/provisioning.js:37:13
       email: email,
       name: name,
       profileImage: picture,
-      role: config.defaultRole || 'Candidate', // [Requirement: correct default role]
+      role: config.defaultRole && 'Candidate', // [Requirement: correct default role]
       isNewUser: true // [Requirement: First-time login onboarding flag]
     };
killedBy: All tests
statusReason: > auth-test-lab@1.0.0 test
> node --experimental-vm-modules node_modules/.bin/jest --coverage


(node:2744) ExperimentalWarning: VM Modules is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

FAIL tests/provisioning.test.js

[Killed] ConditionalExpression
src/provisioning.js:37:13
       email: email,
       name: name,
       profileImage: picture,
-      role: config.defaultRole || 'Candidate', // [Requirement: correct default role]
+      role: true, // [Requirement: correct default role]
       isNewUser: true // [Requirement: First-time login onboarding flag]
     };
killedBy: All tests
statusReason: > auth-test-lab@1.0.0 test
> node --experimental-vm-modules node_modules/.bin/jest --coverage


(node:2690) ExperimentalWarning: VM Modules is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

FAIL tests/provisioning.test.js

[Killed] BooleanLiteral
src/provisioning.js:38:18
       name: name,
       profileImage: picture,
       role: config.defaultRole || 'Candidate', // [Requirement: correct default role]
-      isNewUser: true // [Requirement: First-time login onboarding flag]
+      isNewUser: false // [Requirement: First-time login onboarding flag]
     };
     database.push(user);
killedBy: All tests
statusReason: > auth-test-lab@1.0.0 test
> node --experimental-vm-modules node_modules/.bin/jest --coverage


(node:2798) ExperimentalWarning: VM Modules is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

FAIL tests/provisioning.test.js
