[Killed] BlockStatement
src/controllers/oauth.controller.js:6:44
 import { OAuthService } from '../services/oauth.service.js';
 import { logger } from '../../logger.js';
 
-export const initiateLogin = (req, res) => {
-    const { provider } = req.params;
-    const validProviders = ['google', 'github', 'azure'];
-    
-    if (!validProviders.includes(provider)) {
-        return res.status(400).json({ error: "Unsupported OAuth provider" });
-    }
-
-    // AC2: Anti-CSRF Protection via cryptographically secure random state
-    const state = crypto.randomBytes(32).toString('hex');
-    
-    // Store state in a secured, HTTP-only temporary session cookie
-    res.cookie(`oauth_state_${provider}`, state, {
-        httpOnly: true,
-        secure: process.env.NODE_ENV === 'production',
-        sameSite: 'lax',
-        maxAge: 10 * 60 * 1000 // 10-minute expiry window
-    });
-
-    const authUrl = OAuthService.generateAuthUrl(provider, state);
-    return res.redirect(authUrl);
-};
+export const initiateLogin = (req, res) => {};
 
 export const handleCallback = async (req, res) => {
killedBy: OAuth Controller - Security & Mutation Protection Suite initiateLogin should reject unsupported third-party OAuth providers with 400
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400

Number of calls: 0

[Killed] StringLiteral
src/controllers/oauth.controller.js:8:39
 
 export const initiateLogin = (req, res) => {
     const { provider } = req.params;
-    const validProviders = ['google', 'github', 'azure'];
+    const validProviders = ['google', "", 'azure'];
     
     if (!validProviders.includes(provider)) {
killedBy: OAuth Controller - Security & Mutation Protection Suite initiateLogin should enforce secure configuration setting flags when running in production environments
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "oauth_state_github", Any<String>, ObjectContaining {"secure": true}

Number of calls: 0

[Killed] StringLiteral
src/controllers/oauth.controller.js:8:29
 
 export const initiateLogin = (req, res) => {
     const { provider } = req.params;
-    const validProviders = ['google', 'github', 'azure'];
+    const validProviders = ["", 'github', 'azure'];
     
     if (!validProviders.includes(provider)) {
killedBy: OAuth Controller - Security & Mutation Protection Suite initiateLogin should establish cryptographically secure random state and store cookie
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "oauth_state_google", Any<String>, ObjectContaining {"httpOnly": true, "sameSite": "lax"}

Number of calls: 0

[Killed] BlockStatement
src/controllers/oauth.controller.js:10:45
     const { provider } = req.params;
     const validProviders = ['google', 'github', 'azure'];
     
-    if (!validProviders.includes(provider)) {
-        return res.status(400).json({ error: "Unsupported OAuth provider" });
-    }
+    if (!validProviders.includes(provider)) {}
 
     // AC2: Anti-CSRF Protection via cryptographically secure random state
killedBy: OAuth Controller - Security & Mutation Protection Suite initiateLogin should reject unsupported third-party OAuth providers with 400
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400

Number of calls: 0

[Killed] BooleanLiteral
src/controllers/oauth.controller.js:10:9
     const { provider } = req.params;
     const validProviders = ['google', 'github', 'azure'];
     
-    if (!validProviders.includes(provider)) {
+    if (validProviders.includes(provider)) {
         return res.status(400).json({ error: "Unsupported OAuth provider" });
     }
killedBy: OAuth Controller - Security & Mutation Protection Suite initiateLogin should reject unsupported third-party OAuth providers with 400
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400

Number of calls: 0

[Killed] StringLiteral
src/controllers/oauth.controller.js:11:46
     const validProviders = ['google', 'github', 'azure'];
     
     if (!validProviders.includes(provider)) {
-        return res.status(400).json({ error: "Unsupported OAuth provider" });
+        return res.status(400).json({ error: "" });
     }
 
killedBy: OAuth Controller - Security & Mutation Protection Suite initiateLogin should reject unsupported third-party OAuth providers with 400
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "error": "Unsupported OAuth provider",
+   "error": "",

[Killed] StringLiteral
src/controllers/oauth.controller.js:15:51
     }
 
     // AC2: Anti-CSRF Protection via cryptographically secure random state
-    const state = crypto.randomBytes(32).toString('hex');
+    const state = crypto.randomBytes(32).toString("");
     
     // Store state in a secured, HTTP-only temporary session cookie
killedBy: OAuth Controller - Security & Mutation Protection Suite initiateLogin should establish cryptographically secure random state and store cookie
statusReason: TypeError: Unknown encoding:

[Killed] StringLiteral
src/controllers/oauth.controller.js:18:16
     const state = crypto.randomBytes(32).toString('hex');
     
     // Store state in a secured, HTTP-only temporary session cookie
-    res.cookie(`oauth_state_${provider}`, state, {
+    res.cookie(``, state, {
         httpOnly: true,
         secure: process.env.NODE_ENV === 'production',
killedBy: OAuth Controller - Security & Mutation Protection Suite initiateLogin should establish cryptographically secure random state and store cookie
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "oauth_state_google", Any<String>, ObjectContaining {"httpOnly": true, "sameSite": "lax"}
Received: "", "d7e326f8de6f2b5ac4c7da94464a0d58ed951aaee58eafa3c1ad50f6480988c3", {"httpOnly": true, "maxAge": 600000, "sameSite": "lax", "secure": false}

Number of calls: 1

[Killed] BooleanLiteral
src/controllers/oauth.controller.js:19:19
     
     // Store state in a secured, HTTP-only temporary session cookie
     res.cookie(`oauth_state_${provider}`, state, {
-        httpOnly: true,
+        httpOnly: false,
         secure: process.env.NODE_ENV === 'production',
         sameSite: 'lax',
killedBy: OAuth Controller - Security & Mutation Protection Suite initiateLogin should establish cryptographically secure random state and store cookie
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "oauth_state_google", Any<String>, ObjectContaining {"httpOnly": true, "sameSite": "lax"}
Received: "oauth_state_google", "278d5958b67995fe608100f96e9b0c81302f3665596bb49b7dcdfe3d4b57559f", {"httpOnly": false, "maxAge": 600000, "sameSite": "lax", "secure": false}

Number of calls: 1

[Killed] ConditionalExpression
src/controllers/oauth.controller.js:20:17
     // Store state in a secured, HTTP-only temporary session cookie
     res.cookie(`oauth_state_${provider}`, state, {
         httpOnly: true,
-        secure: process.env.NODE_ENV === 'production',
+        secure: true,
         sameSite: 'lax',
         maxAge: 10 * 60 * 1000 // 10-minute expiry window
killedBy: OAuth Controller - Security & Mutation Protection Suite OAuth Controller - Final Mutant Killers cookie secure should be false in development
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "oauth_state_google", Any<String>, ObjectContaining {"secure": false}
Received: "oauth_state_google", "c3f14bfbc9b75d6a31614195ad516082d9ca74cb5eccf91cc48d1f38415a9ebf", {"httpOnly": true, "maxAge": 600000, "sameSite": "lax", "secure": true}

Number of calls: 1

[Killed] ArithmeticOperator
src/controllers/oauth.controller.js:22:17
         httpOnly: true,
         secure: process.env.NODE_ENV === 'production',
         sameSite: 'lax',
-        maxAge: 10 * 60 * 1000 // 10-minute expiry window
+        maxAge: 10 / 60 * 1000 // 10-minute expiry window
     });
 
killedBy: OAuth Controller - Security & Mutation Protection Suite OAuth Controller - Final Mutant Killers cookie maxAge should be exactly 600000ms (10 minutes)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "oauth_state_google", Any<String>, ObjectContaining {"maxAge": 600000}
Received: "oauth_state_google", "34346b2f9d57a34c6134f1d830949df14d07e8281957eb81d045fde2eb7cd6c4", {"httpOnly": true, "maxAge": 166.66666666666666, "sameSite": "lax", "secure": false}

Number of calls: 1

[Killed] ArithmeticOperator
src/controllers/oauth.controller.js:22:17
         httpOnly: true,
         secure: process.env.NODE_ENV === 'production',
         sameSite: 'lax',
-        maxAge: 10 * 60 * 1000 // 10-minute expiry window
+        maxAge: 10 * 60 / 1000 // 10-minute expiry window
     });
 
killedBy: OAuth Controller - Security & Mutation Protection Suite OAuth Controller - Final Mutant Killers cookie maxAge should be exactly 600000ms (10 minutes)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "oauth_state_google", Any<String>, ObjectContaining {"maxAge": 600000}
Received: "oauth_state_google", "2d00b078ee71a76b0a79d6489667c91f51a4e06bcd7c011c80b8b841be0ed0bc", {"httpOnly": true, "maxAge": 0.6, "sameSite": "lax", "secure": false}

Number of calls: 1

[Killed] StringLiteral
src/controllers/oauth.controller.js:37:21
     // AC2 Verification: Validate state to explicitly block Cross-Site Request Forgery (CSRF)
     // Stryker disable next-line all
     if (!state || !savedState || state !== savedState) {
-        logger.warn('SECURITY_ALERT', 'Potential CSRF attack detected via OAuth state mismatch', { provider });
+        logger.warn("", 'Potential CSRF attack detected via OAuth state mismatch', { provider });
         return res.status(403).json({ error: "Anti-CSRF state validation failed. Request denied." });
     }
killedBy: OAuth Controller - Security & Mutation Protection Suite handleCallback should aggressively block requests when state configuration parameters are missing or unmatched (CSRF Defense)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "SECURITY_ALERT",
+ "",
  "Potential CSRF attack detected via OAuth state mismatch",

[Killed] StringLiteral
src/controllers/oauth.controller.js:38:46
     // Stryker disable next-line all
     if (!state || !savedState || state !== savedState) {
         logger.warn('SECURITY_ALERT', 'Potential CSRF attack detected via OAuth state mismatch', { provider });
-        return res.status(403).json({ error: "Anti-CSRF state validation failed. Request denied." });
+        return res.status(403).json({ error: "" });
     }
 
killedBy: OAuth Controller - Security & Mutation Protection Suite handleCallback should aggressively block requests when state configuration parameters are missing or unmatched (CSRF Defense)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "error": "Anti-CSRF state validation failed. Request denied.",
+   "error": "",

[Killed] ObjectLiteral
src/controllers/oauth.controller.js:46:37
 
     // Stryker disable next-line all
     if (!code) {
-        return res.status(400).json({ error: "Authorization code missing from provider callback" });
+        return res.status(400).json({});
     }
 
killedBy: OAuth Controller - Security & Mutation Protection Suite handleCallback should decline processing if identity provider token authorization code parameter is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "error": "Authorization code missing from provider callback",
- }

[Killed] BlockStatement
src/controllers/oauth.controller.js:49:9
         return res.status(400).json({ error: "Authorization code missing from provider callback" });
     }
 
-    try {
-        // AC3 Protection: Tokens handled internally inside service layer. 
-        // Notice NO tokens are passed to logger or unencrypted fields.
-        const providerData = await OAuthService.exchangeCodeForTokens(provider, code);
-        
-        // Handle core registration, account linking, and provisioning
-        const authPayload = await OAuthService.processUserSignIn(provider, providerData);
-
-        if (authPayload.isBlocked) {
-            return res.status(403).json({ error: "Access denied. Account is deactivated." });
-        }
-
-        // Return internal application token architecture safely to client
-        return res.status(200).json({
-            message: "OAuth authentication successful",
-            token: authPayload.token,
-            refreshToken: authPayload.refreshToken,
-            user: authPayload.user
-        });
-
-    } catch (error) {
+    try {} catch (error) {
     // Dynamically redact the sensitive token from the error message string
     // Stryker disable next-line all
killedBy: OAuth Controller - Security & Mutation Protection Suite handleCallback should issue token payload response upon successful end-to-end OAuth flow coordination
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "google", "valid_auth_code"

Number of calls: 0

[Killed] ConditionalExpression
src/controllers/oauth.controller.js:57:13
         // Handle core registration, account linking, and provisioning
         const authPayload = await OAuthService.processUserSignIn(provider, providerData);
 
-        if (authPayload.isBlocked) {
+        if (false) {
             return res.status(403).json({ error: "Access denied. Account is deactivated." });
         }
killedBy: OAuth Controller - Security & Mutation Protection Suite handleCallback should block authentication pipelines and reject with 403 status if account flag is deactivated
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 403
Received: 200

Number of calls: 1

[Killed] BlockStatement
src/controllers/oauth.controller.js:57:36
         // Handle core registration, account linking, and provisioning
         const authPayload = await OAuthService.processUserSignIn(provider, providerData);
 
-        if (authPayload.isBlocked) {
-            return res.status(403).json({ error: "Access denied. Account is deactivated." });
-        }
+        if (authPayload.isBlocked) {}
 
         // Return internal application token architecture safely to client
killedBy: OAuth Controller - Security & Mutation Protection Suite handleCallback should block authentication pipelines and reject with 403 status if account flag is deactivated
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 403
Received: 200

Number of calls: 1

[Killed] StringLiteral
src/controllers/oauth.controller.js:58:50
         const authPayload = await OAuthService.processUserSignIn(provider, providerData);
 
         if (authPayload.isBlocked) {
-            return res.status(403).json({ error: "Access denied. Account is deactivated." });
+            return res.status(403).json({ error: "" });
         }
 
killedBy: OAuth Controller - Security & Mutation Protection Suite handleCallback should block authentication pipelines and reject with 403 status if account flag is deactivated
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "error": "Access denied. Account is deactivated.",
+   "error": "",

[Killed] ObjectLiteral
src/controllers/oauth.controller.js:58:41
         const authPayload = await OAuthService.processUserSignIn(provider, providerData);
 
         if (authPayload.isBlocked) {
-            return res.status(403).json({ error: "Access denied. Account is deactivated." });
+            return res.status(403).json({});
         }
 
killedBy: OAuth Controller - Security & Mutation Protection Suite handleCallback should block authentication pipelines and reject with 403 status if account flag is deactivated
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "error": "Access denied. Account is deactivated.",
- }

[Killed] BlockStatement
src/controllers/oauth.controller.js:69:21
             user: authPayload.user
         });
 
-    } catch (error) {
-    // Dynamically redact the sensitive token from the error message string
-    // Stryker disable next-line all
-    const sanitizedMessage = error.message.replace(/secret_idp_access_token_\w+|token_\w+/g, '[MASKED]');
-    
-    logger.error(`Failed exchanging raw token: ${sanitizedMessage}`);
-    return res.status(500).json({ error: "Authentication failed" });
-    }
+    } catch (error) {}
 };
 
killedBy: OAuth Controller - Security & Mutation Protection Suite handleCallback should systematically mask third-party raw tokens from transport logging structures during transaction exceptions
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Timeout] BlockStatement
src/controllers/oauth.controller.js:79:49
     }
 };
 
-export const handleLogout = async (req, res) => {
-    try {
-        const authHeader = req.headers.authorization;
-        const refreshToken = req.body.refreshToken;
-
-        if (!authHeader || !refreshToken) {
-            return res.status(400).json({ error: "Missing tokens required for session revocation" });
-        }
-
-        const accessToken = authHeader.split(' ')[1];
-        
-        // AC5: Mark application access and refresh tokens as fully invalidated/revoked
-        await OAuthService.revokeSessionTokens(accessToken, refreshToken);
-
-        return res.status(200).json({ message: "Successfully logged out and tokens invalidated" });
-    } catch (err) {
-        return res.status(500).json({ error: "Internal server error during session cleanup" });
-    }
-};
+export const handleLogout = async (req, res) => {};
 

[Killed] BlockStatement
src/controllers/oauth.controller.js:80:9
 };
 
 export const handleLogout = async (req, res) => {
-    try {
-        const authHeader = req.headers.authorization;
-        const refreshToken = req.body.refreshToken;
-
-        if (!authHeader || !refreshToken) {
-            return res.status(400).json({ error: "Missing tokens required for session revocation" });
-        }
-
-        const accessToken = authHeader.split(' ')[1];
-        
-        // AC5: Mark application access and refresh tokens as fully invalidated/revoked
-        await OAuthService.revokeSessionTokens(accessToken, refreshToken);
-
-        return res.status(200).json({ message: "Successfully logged out and tokens invalidated" });
-    } catch (err) {
+    try {} catch (err) {
         return res.status(500).json({ error: "Internal server error during session cleanup" });
     }
killedBy: OAuth Controller - Security & Mutation Protection Suite handleLogout should require both access authentication authorization header and reference refresh tokens to proceed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400

Number of calls: 0

[Killed] BooleanLiteral
src/controllers/oauth.controller.js:84:28
         const authHeader = req.headers.authorization;
         const refreshToken = req.body.refreshToken;
 
-        if (!authHeader || !refreshToken) {
+        if (!authHeader || refreshToken) {
             return res.status(400).json({ error: "Missing tokens required for session revocation" });
         }
killedBy: OAuth Controller - Security & Mutation Protection Suite handleLogout should capture individual keys and pass them into the underlying revocation engine mechanisms
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "primary_access_jwt_abc", "associated_refresh_jwt_xyz"

Number of calls: 0

[Killed] BlockStatement
src/controllers/oauth.controller.js:84:43
         const authHeader = req.headers.authorization;
         const refreshToken = req.body.refreshToken;
 
-        if (!authHeader || !refreshToken) {
-            return res.status(400).json({ error: "Missing tokens required for session revocation" });
-        }
+        if (!authHeader || !refreshToken) {}
 
         const accessToken = authHeader.split(' ')[1];
killedBy: OAuth Controller - Security & Mutation Protection Suite handleLogout should require both access authentication authorization header and reference refresh tokens to proceed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] StringLiteral
src/controllers/oauth.controller.js:85:50
         const refreshToken = req.body.refreshToken;
 
         if (!authHeader || !refreshToken) {
-            return res.status(400).json({ error: "Missing tokens required for session revocation" });
+            return res.status(400).json({ error: "" });
         }
 
killedBy: OAuth Controller - Security & Mutation Protection Suite handleLogout should require both access authentication authorization header and reference refresh tokens to proceed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "error": "Missing tokens required for session revocation",
+   "error": "",

[Killed] ObjectLiteral
src/controllers/oauth.controller.js:85:41
         const refreshToken = req.body.refreshToken;
 
         if (!authHeader || !refreshToken) {
-            return res.status(400).json({ error: "Missing tokens required for session revocation" });
+            return res.status(400).json({});
         }
 
killedBy: OAuth Controller - Security & Mutation Protection Suite handleLogout should require both access authentication authorization header and reference refresh tokens to proceed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "error": "Missing tokens required for session revocation",
- }

[Killed] ObjectLiteral
src/controllers/oauth.controller.js:93:37
         // AC5: Mark application access and refresh tokens as fully invalidated/revoked
         await OAuthService.revokeSessionTokens(accessToken, refreshToken);
 
-        return res.status(200).json({ message: "Successfully logged out and tokens invalidated" });
+        return res.status(200).json({});
     } catch (err) {
         return res.status(500).json({ error: "Internal server error during session cleanup" });
killedBy: OAuth Controller - Security & Mutation Protection Suite handleLogout should capture individual keys and pass them into the underlying revocation engine mechanisms
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "Successfully logged out and tokens invalidated",
- }

[Killed] BlockStatement
src/controllers/oauth.controller.js:94:19
         await OAuthService.revokeSessionTokens(accessToken, refreshToken);
 
         return res.status(200).json({ message: "Successfully logged out and tokens invalidated" });
-    } catch (err) {
-        return res.status(500).json({ error: "Internal server error during session cleanup" });
-    }
+    } catch (err) {}
 };
 
killedBy: OAuth Controller - Security & Mutation Protection Suite handleLogout should securely return 500 status codes when underlying service blocklist engines experience runtime errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] ObjectLiteral
src/controllers/oauth.controller.js:95:37
 
         return res.status(200).json({ message: "Successfully logged out and tokens invalidated" });
     } catch (err) {
-        return res.status(500).json({ error: "Internal server error during session cleanup" });
+        return res.status(500).json({});
     }
 };
killedBy: OAuth Controller - Security & Mutation Protection Suite handleLogout should securely return 500 status codes when underlying service blocklist engines experience runtime errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "error": "Internal server error during session cleanup",
- }
