[Killed] BlockStatement
src/controllers/adminController.js:14:48
 /**
  * GET ALL USERS
  */
-export const getAllUsers = async (req, res) => {
-    try {
-        const users = await User.find({});
-        return res.status(200).json(users || []);
-    } catch (error) {
-        return res.status(500).json({ error: "Internal Server Error" });
-    }
-};
+export const getAllUsers = async (req, res) => {};
 
 /**
killedBy: Admin Controller - SSDLC Clean Suite getAllUsers should return all users (non-empty)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] BlockStatement
src/controllers/adminController.js:15:9
  * GET ALL USERS
  */
 export const getAllUsers = async (req, res) => {
-    try {
-        const users = await User.find({});
-        return res.status(200).json(users || []);
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({ error: "Internal Server Error" });
     }
killedBy: Admin Controller - SSDLC Clean Suite getAllUsers should return all users (non-empty)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] ConditionalExpression
src/controllers/adminController.js:17:37
 export const getAllUsers = async (req, res) => {
     try {
         const users = await User.find({});
-        return res.status(200).json(users || []);
+        return res.status(200).json(true);
     } catch (error) {
         return res.status(500).json({ error: "Internal Server Error" });
killedBy: Admin Controller - SSDLC Clean Suite getAllUsers should return all users (non-empty)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [{"id": "1"}, {"id": "2"}]
Received: true

Number of calls: 1

[Killed] LogicalOperator
src/controllers/adminController.js:17:37
 export const getAllUsers = async (req, res) => {
     try {
         const users = await User.find({});
-        return res.status(200).json(users || []);
+        return res.status(200).json(users && []);
     } catch (error) {
         return res.status(500).json({ error: "Internal Server Error" });
killedBy: Admin Controller - SSDLC Clean Suite getAllUsers should return all users (non-empty)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Array [
-   Object {
-     "id": "1",

[Killed] BlockStatement
src/controllers/adminController.js:18:21
     try {
         const users = await User.find({});
         return res.status(200).json(users || []);
-    } catch (error) {
-        return res.status(500).json({ error: "Internal Server Error" });
-    }
+    } catch (error) {}
 };
 
killedBy: Admin Controller - SSDLC Clean Suite getAllUsers should return 500 with error message on DB failure
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] StringLiteral
src/controllers/adminController.js:19:46
         const users = await User.find({});
         return res.status(200).json(users || []);
     } catch (error) {
-        return res.status(500).json({ error: "Internal Server Error" });
+        return res.status(500).json({ error: "" });
     }
 };
killedBy: Admin Controller - SSDLC Clean Suite getAllUsers should return 500 with error message on DB failure
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "error": "Internal Server Error",
+   "error": "",

[Killed] ObjectLiteral
src/controllers/adminController.js:19:37
         const users = await User.find({});
         return res.status(200).json(users || []);
     } catch (error) {
-        return res.status(500).json({ error: "Internal Server Error" });
+        return res.status(500).json({});
     }
 };
killedBy: Admin Controller - SSDLC Clean Suite getAllUsers should return 500 with error message on DB failure
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "error": "Internal Server Error",
- }

[Killed] BlockStatement
src/controllers/adminController.js:31:40
         const { id } = req.params;
         const { role, status } = req.body;
 
-        if (!id || (!role && !status)) {
-            return res.status(400).json({ error: "Missing userId or update parameters" });
-        }
+        if (!id || (!role && !status)) {}
 
         const adminId = req.user?.id || 'SYSTEM';
killedBy: Admin Controller - SSDLC Clean Suite updateUser should return 400 with exact error when id is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 404

Number of calls: 1

[Killed] BooleanLiteral
src/controllers/adminController.js:31:30
         const { id } = req.params;
         const { role, status } = req.body;
 
-        if (!id || (!role && !status)) {
+        if (!id || (!role && status)) {
             return res.status(400).json({ error: "Missing userId or update parameters" });
         }
killedBy: Admin Controller - SSDLC Clean Suite updateUser should return 400 when neither role nor status provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 404

Number of calls: 1

[Killed] StringLiteral
src/controllers/adminController.js:32:50
         const { role, status } = req.body;
 
         if (!id || (!role && !status)) {
-            return res.status(400).json({ error: "Missing userId or update parameters" });
+            return res.status(400).json({ error: "" });
         }
 
killedBy: Admin Controller - SSDLC Clean Suite updateUser should return 400 with exact error when id is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "error": "Missing userId or update parameters",
+   "error": "",

[Killed] ObjectLiteral
src/controllers/adminController.js:32:41
         const { role, status } = req.body;
 
         if (!id || (!role && !status)) {
-            return res.status(400).json({ error: "Missing userId or update parameters" });
+            return res.status(400).json({});
         }
 
killedBy: Admin Controller - SSDLC Clean Suite updateUser should return 400 with exact error when id is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "error": "Missing userId or update parameters",
- }

[Killed] OptionalChaining
src/controllers/adminController.js:35:25
             return res.status(400).json({ error: "Missing userId or update parameters" });
         }
 
-        const adminId = req.user?.id || 'SYSTEM';
+        const adminId = req.user.id || 'SYSTEM';
 
         const validRoles = ['ADMIN', 'MANAGER', 'USER'];
killedBy: Admin Controller - SSDLC Clean Suite updateUser should return 400 for invalid role
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
src/controllers/adminController.js:35:25
             return res.status(400).json({ error: "Missing userId or update parameters" });
         }
 
-        const adminId = req.user?.id || 'SYSTEM';
+        const adminId = false;
 
         const validRoles = ['ADMIN', 'MANAGER', 'USER'];
killedBy: Admin Controller - SSDLC Clean Suite updateUser should return 202 for ADMIN role and fire correct audit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "admin-1", "1", "ROLE_REQUEST", "PENDING_APPROVAL: ADMIN"
Received: false, "1", "ROLE_REQUEST", "PENDING_APPROVAL: ADMIN"

Number of calls: 1

[Killed] BlockStatement
src/controllers/adminController.js:38:49
         const adminId = req.user?.id || 'SYSTEM';
 
         const validRoles = ['ADMIN', 'MANAGER', 'USER'];
-        if (role && !validRoles.includes(role)) {
-            return res.status(400).json({ error: "Invalid role specified" });
-        }
+        if (role && !validRoles.includes(role)) {}
 
         const validStatuses = ['ACTIVE', 'DEACTIVATED'];
killedBy: Admin Controller - SSDLC Clean Suite updateUser should return 400 for invalid role
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 404

Number of calls: 1

[Killed] LogicalOperator
src/controllers/adminController.js:38:13
         const adminId = req.user?.id || 'SYSTEM';
 
         const validRoles = ['ADMIN', 'MANAGER', 'USER'];
-        if (role && !validRoles.includes(role)) {
+        if (role || !validRoles.includes(role)) {
             return res.status(400).json({ error: "Invalid role specified" });
         }
killedBy: Admin Controller - SSDLC Clean Suite updateUser should return 400 for invalid status
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "error": "Invalid status specified",
+   "error": "Invalid role specified",

[Killed] ObjectLiteral
src/controllers/adminController.js:39:41
 
         const validRoles = ['ADMIN', 'MANAGER', 'USER'];
         if (role && !validRoles.includes(role)) {
-            return res.status(400).json({ error: "Invalid role specified" });
+            return res.status(400).json({});
         }
 
killedBy: Admin Controller - SSDLC Clean Suite updateUser should return 400 for invalid role
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "error": "Invalid role specified",
- }

[Killed] StringLiteral
src/controllers/adminController.js:39:50
 
         const validRoles = ['ADMIN', 'MANAGER', 'USER'];
         if (role && !validRoles.includes(role)) {
-            return res.status(400).json({ error: "Invalid role specified" });
+            return res.status(400).json({ error: "" });
         }
 
killedBy: Admin Controller - SSDLC Clean Suite updateUser should return 400 for invalid role
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "error": "Invalid role specified",
+   "error": "",

[Killed] BooleanLiteral
src/controllers/adminController.js:43:23
         }
 
         const validStatuses = ['ACTIVE', 'DEACTIVATED'];
-        if (status && !validStatuses.includes(status)) {
+        if (status && validStatuses.includes(status)) {
             return res.status(400).json({ error: "Invalid status specified" });
         }
killedBy: Admin Controller - Targeted Fixes should successfully permit moving account configurations to DEACTIVATED state status layouts
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 400

Number of calls: 1

[Killed] BlockStatement
src/controllers/adminController.js:43:56
         }
 
         const validStatuses = ['ACTIVE', 'DEACTIVATED'];
-        if (status && !validStatuses.includes(status)) {
-            return res.status(400).json({ error: "Invalid status specified" });
-        }
+        if (status && !validStatuses.includes(status)) {}
 
         // Elevated role → approval workflow
killedBy: Admin Controller - SSDLC Clean Suite updateUser should return 400 for invalid status
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 404

Number of calls: 1

[Killed] StringLiteral
src/controllers/adminController.js:44:50
 
         const validStatuses = ['ACTIVE', 'DEACTIVATED'];
         if (status && !validStatuses.includes(status)) {
-            return res.status(400).json({ error: "Invalid status specified" });
+            return res.status(400).json({ error: "" });
         }
 
killedBy: Admin Controller - SSDLC Clean Suite updateUser should return 400 for invalid status
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "error": "Invalid status specified",
+   "error": "",

[Killed] ObjectLiteral
src/controllers/adminController.js:44:41
 
         const validStatuses = ['ACTIVE', 'DEACTIVATED'];
         if (status && !validStatuses.includes(status)) {
-            return res.status(400).json({ error: "Invalid status specified" });
+            return res.status(400).json({});
         }
 
killedBy: Admin Controller - SSDLC Clean Suite updateUser should return 400 for invalid status
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "error": "Invalid status specified",
- }

[Killed] ConditionalExpression
src/controllers/adminController.js:48:13
         }
 
         // Elevated role → approval workflow
-        if (role && ['ADMIN', 'MANAGER'].includes(role)) {
+        if (true) {
             await auditService.logAuditTrail(adminId, id, "ROLE_REQUEST", `PENDING_APPROVAL: ${role}`);
             return res.status(202).json({
killedBy: Admin Controller - Targeted Fixes should successfully permit moving account configurations to DEACTIVATED state status layouts
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 202

Number of calls: 1

[Killed] LogicalOperator
src/controllers/adminController.js:48:13
         }
 
         // Elevated role → approval workflow
-        if (role && ['ADMIN', 'MANAGER'].includes(role)) {
+        if (role || ['ADMIN', 'MANAGER'].includes(role)) {
             await auditService.logAuditTrail(adminId, id, "ROLE_REQUEST", `PENDING_APPROVAL: ${role}`);
             return res.status(202).json({
killedBy: Admin Controller - SSDLC Clean Suite updateUser should NOT return 202 for USER role — proceeds to DB
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 202

Number of calls: 1

[Killed] BooleanLiteral
src/controllers/adminController.js:59:20
         const updatedUser = await User.findByIdAndUpdate(
             id,
             { role, status },
-            { new: true }
+            { new: false }
         );
 
killedBy: Admin Controller - SSDLC Clean Suite updateUser should call findByIdAndUpdate with exact args including new:true
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "1",
  {"role": undefined, "status": "ACTIVE"},
  Object {

[Killed] BooleanLiteral
src/controllers/adminController.js:62:13
             { new: true }
         );
 
-        if (!updatedUser) {
+        if (updatedUser) {
             return res.status(404).json({ error: "User not found" });
         }
killedBy: Admin Controller - SSDLC Clean Suite updateUser should NOT return 202 for USER role — proceeds to DB
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 404

Number of calls: 1

[Killed] ConditionalExpression
src/controllers/adminController.js:62:13
             { new: true }
         );
 
-        if (!updatedUser) {
+        if (true) {
             return res.status(404).json({ error: "User not found" });
         }
killedBy: Admin Controller - SSDLC Clean Suite updateUser should NOT return 202 for USER role — proceeds to DB
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 404

Number of calls: 1

[Killed] ConditionalExpression
src/controllers/adminController.js:70:70
             adminId,
             id,
             "ADMIN_ACTION",
-            `Update finalized: Role=${role || 'UNCHANGED'}, Status=${status || 'UNCHANGED'}`
+            `Update finalized: Role=${role || 'UNCHANGED'}, Status=${false}`
         );
 
killedBy: Admin Controller - SSDLC Clean Suite updateUser should audit with exact UNCHANGED string when only status is provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "admin-1", "1", "ADMIN_ACTION", "Update finalized: Role=UNCHANGED, Status=ACTIVE"
Received: "admin-1", "1", "ADMIN_ACTION", "Update finalized: Role=UNCHANGED, Status=false"

Number of calls: 1

[Killed] LogicalOperator
src/controllers/adminController.js:70:39
             adminId,
             id,
             "ADMIN_ACTION",
-            `Update finalized: Role=${role || 'UNCHANGED'}, Status=${status || 'UNCHANGED'}`
+            `Update finalized: Role=${role && 'UNCHANGED'}, Status=${status || 'UNCHANGED'}`
         );
 
killedBy: Admin Controller - SSDLC Clean Suite updateUser should audit with exact UNCHANGED string when only status is provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "admin-1", "1", "ADMIN_ACTION", "Update finalized: Role=UNCHANGED, Status=ACTIVE"
Received: "admin-1", "1", "ADMIN_ACTION", "Update finalized: Role=undefined, Status=ACTIVE"

Number of calls: 1

[Killed] BlockStatement
src/controllers/adminController.js:78:21
             updatedUser: id
         });
 
-    } catch (error) {
-        return res.status(500).json({ error: "Internal Server Error" });
-    }
+    } catch (error) {}
 };
 
killedBy: Admin Controller - SSDLC Clean Suite updateUser should return 500 with exact error on unexpected failure
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BlockStatement
src/controllers/adminController.js:86:47
 /**
  * DELETE USER
  */
-export const deleteUser = async (req, res) => {
-    try {
-        const { id } = req.params;
-        const deletedUser = await User.findOneAndDelete({ _id: id });
-
-        if (!deletedUser) {
-            return res.status(404).json({ error: "User not found" });
-        }
-
-        await auditService.logAuditTrail(req.user?.id || 'SYSTEM', id, "DELETE_USER", "User account removed");
-
-        return res.status(200).json({ id, message: "Deleted" });
-    } catch (error) {
-        return res.status(500).json({ error: "Internal Server Error" });
-    }
-};
+export const deleteUser = async (req, res) => {};
 
 /**
killedBy: Admin Controller - SSDLC Clean Suite deleteUser should call findOneAndDelete with exact query and return 404 if not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"_id": "999"}

Number of calls: 0

[Killed] BlockStatement
src/controllers/adminController.js:87:9
  * DELETE USER
  */
 export const deleteUser = async (req, res) => {
-    try {
-        const { id } = req.params;
-        const deletedUser = await User.findOneAndDelete({ _id: id });
-
-        if (!deletedUser) {
-            return res.status(404).json({ error: "User not found" });
-        }
-
-        await auditService.logAuditTrail(req.user?.id || 'SYSTEM', id, "DELETE_USER", "User account removed");
-
-        return res.status(200).json({ id, message: "Deleted" });
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({ error: "Internal Server Error" });
     }
killedBy: Admin Controller - SSDLC Clean Suite deleteUser should call findOneAndDelete with exact query and return 404 if not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"_id": "999"}

Number of calls: 0

[Killed] ConditionalExpression
src/controllers/adminController.js:91:13
         const { id } = req.params;
         const deletedUser = await User.findOneAndDelete({ _id: id });
 
-        if (!deletedUser) {
+        if (true) {
             return res.status(404).json({ error: "User not found" });
         }
killedBy: Admin Controller - SSDLC Clean Suite deleteUser should delete, return 200 with exact body, and log audit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 404

Number of calls: 1

[Killed] ConditionalExpression
src/controllers/adminController.js:91:13
         const { id } = req.params;
         const deletedUser = await User.findOneAndDelete({ _id: id });
 
-        if (!deletedUser) {
+        if (false) {
             return res.status(404).json({ error: "User not found" });
         }
killedBy: Admin Controller - SSDLC Clean Suite deleteUser should call findOneAndDelete with exact query and return 404 if not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 200

Number of calls: 1

[Killed] ObjectLiteral
src/controllers/adminController.js:92:41
         const deletedUser = await User.findOneAndDelete({ _id: id });
 
         if (!deletedUser) {
-            return res.status(404).json({ error: "User not found" });
+            return res.status(404).json({});
         }
 
killedBy: Admin Controller - SSDLC Clean Suite deleteUser should call findOneAndDelete with exact query and return 404 if not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "error": "User not found",
- }

[Killed] ConditionalExpression
src/controllers/adminController.js:95:42
             return res.status(404).json({ error: "User not found" });
         }
 
-        await auditService.logAuditTrail(req.user?.id || 'SYSTEM', id, "DELETE_USER", "User account removed");
+        await auditService.logAuditTrail(false, id, "DELETE_USER", "User account removed");
 
         return res.status(200).json({ id, message: "Deleted" });
killedBy: Admin Controller - SSDLC Clean Suite deleteUser should delete, return 200 with exact body, and log audit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "admin-1", "1", "DELETE_USER", "User account removed"
Received: false, "1", "DELETE_USER", "User account removed"

Number of calls: 1

[Killed] ConditionalExpression
src/controllers/adminController.js:95:42
             return res.status(404).json({ error: "User not found" });
         }
 
-        await auditService.logAuditTrail(req.user?.id || 'SYSTEM', id, "DELETE_USER", "User account removed");
+        await auditService.logAuditTrail(true, id, "DELETE_USER", "User account removed");
 
         return res.status(200).json({ id, message: "Deleted" });
killedBy: Admin Controller - SSDLC Clean Suite deleteUser should delete, return 200 with exact body, and log audit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "admin-1", "1", "DELETE_USER", "User account removed"
Received: true, "1", "DELETE_USER", "User account removed"

Number of calls: 1

[Killed] BlockStatement
src/controllers/adminController.js:98:21
         await auditService.logAuditTrail(req.user?.id || 'SYSTEM', id, "DELETE_USER", "User account removed");
 
         return res.status(200).json({ id, message: "Deleted" });
-    } catch (error) {
-        return res.status(500).json({ error: "Internal Server Error" });
-    }
+    } catch (error) {}
 };
 
killedBy: Admin Controller - SSDLC Clean Suite deleteUser should return 500 with exact error on DB failure
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] ConditionalExpression
src/controllers/adminController.js:116:25
         // Stryker disable next-line all
         const userId  = req.params?.userId ?? req.body?.userId;
         const { action, role } = req.body;
-        const adminId = req.user?.id || 'SYSTEM';
+        const adminId = false;
 
         // Validation must run BEFORE any async calls that would crash on bad data
killedBy: Admin Controller - SSDLC Clean Suite approveRole should approve: call DB, log ROLE_APPROVED with exact string, return exact message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "admin-1", "1", "ROLE_APPROVED", "Decision finalized: APPROVE"
Received: false, "1", "ROLE_APPROVED", "Decision finalized: APPROVE"

Number of calls: 1

[Killed] OptionalChaining
src/controllers/adminController.js:116:25
         // Stryker disable next-line all
         const userId  = req.params?.userId ?? req.body?.userId;
         const { action, role } = req.body;
-        const adminId = req.user?.id || 'SYSTEM';
+        const adminId = req.user.id || 'SYSTEM';
 
         // Validation must run BEFORE any async calls that would crash on bad data
killedBy: Admin Controller - SSDLC Clean Suite approveRole should return 400 with exact error for invalid action
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
src/controllers/adminController.js:119:13
         const adminId = req.user?.id || 'SYSTEM';
 
         // Validation must run BEFORE any async calls that would crash on bad data
-        if (!['APPROVE', 'REJECT'].includes(action)) {
+        if (false) {
             return res.status(400).json({ error: "Invalid action. Use APPROVE or REJECT" });
         }
killedBy: Admin Controller - SSDLC Clean Suite approveRole should return 400 with exact error for invalid action
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 200

Number of calls: 1

[Killed] BooleanLiteral
src/controllers/adminController.js:119:13
         const adminId = req.user?.id || 'SYSTEM';
 
         // Validation must run BEFORE any async calls that would crash on bad data
-        if (!['APPROVE', 'REJECT'].includes(action)) {
+        if (['APPROVE', 'REJECT'].includes(action)) {
             return res.status(400).json({ error: "Invalid action. Use APPROVE or REJECT" });
         }
killedBy: Admin Controller - SSDLC Clean Suite approveRole should return 400 with exact error for invalid action
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 200

Number of calls: 1

[Killed] ConditionalExpression
src/controllers/adminController.js:123:13
             return res.status(400).json({ error: "Invalid action. Use APPROVE or REJECT" });
         }
 
-        if (action === 'APPROVE') {
+        if (false) {
             if (!role) return res.status(400).json({ error: "Role is required for approval" });
             await User.findByIdAndUpdate(userId, { role });
killedBy: Admin Controller - SSDLC Clean Suite approveRole should return 400 when APPROVE sent without role
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 200

Number of calls: 1

[Killed] BlockStatement
src/controllers/adminController.js:123:35
             return res.status(400).json({ error: "Invalid action. Use APPROVE or REJECT" });
         }
 
-        if (action === 'APPROVE') {
-            if (!role) return res.status(400).json({ error: "Role is required for approval" });
-            await User.findByIdAndUpdate(userId, { role });
-        }
+        if (action === 'APPROVE') {}
 
         const auditAction = action === 'APPROVE' ? "ROLE_APPROVED" : "ROLE_REJECTED";
killedBy: Admin Controller - SSDLC Clean Suite approveRole should return 400 when APPROVE sent without role
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 200

Number of calls: 1

[Killed] ConditionalExpression
src/controllers/adminController.js:124:17
         }
 
         if (action === 'APPROVE') {
-            if (!role) return res.status(400).json({ error: "Role is required for approval" });
+            if (true) return res.status(400).json({ error: "Role is required for approval" });
             await User.findByIdAndUpdate(userId, { role });
         }
killedBy: Admin Controller - SSDLC Clean Suite approveRole should approve: call DB, log ROLE_APPROVED with exact string, return exact message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "1", {"role": "MANAGER"}

Number of calls: 0

[Killed] BooleanLiteral
src/controllers/adminController.js:124:17
         }
 
         if (action === 'APPROVE') {
-            if (!role) return res.status(400).json({ error: "Role is required for approval" });
+            if (role) return res.status(400).json({ error: "Role is required for approval" });
             await User.findByIdAndUpdate(userId, { role });
         }
killedBy: Admin Controller - SSDLC Clean Suite approveRole should return 400 when APPROVE sent without role
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 200

Number of calls: 1

[Killed] ConditionalExpression
src/controllers/adminController.js:128:29
             await User.findByIdAndUpdate(userId, { role });
         }
 
-        const auditAction = action === 'APPROVE' ? "ROLE_APPROVED" : "ROLE_REJECTED";
+        const auditAction = true ? "ROLE_APPROVED" : "ROLE_REJECTED";
 
         await auditService.logAuditTrail(adminId, userId, auditAction, `Decision finalized: ${action}`);
killedBy: Admin Controller - SSDLC Clean Suite approveRole should reject: skip DB, log ROLE_REJECTED with exact string, return exact message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "admin-1", "1", "ROLE_REJECTED", "Decision finalized: REJECT"
Received: "admin-1", "1", "ROLE_APPROVED", "Decision finalized: REJECT"

Number of calls: 1

[Killed] EqualityOperator
src/controllers/adminController.js:128:29
             await User.findByIdAndUpdate(userId, { role });
         }
 
-        const auditAction = action === 'APPROVE' ? "ROLE_APPROVED" : "ROLE_REJECTED";
+        const auditAction = action !== 'APPROVE' ? "ROLE_APPROVED" : "ROLE_REJECTED";
 
         await auditService.logAuditTrail(adminId, userId, auditAction, `Decision finalized: ${action}`);
killedBy: Admin Controller - SSDLC Clean Suite approveRole should approve: call DB, log ROLE_APPROVED with exact string, return exact message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "admin-1", "1", "ROLE_APPROVED", "Decision finalized: APPROVE"
Received: "admin-1", "1", "ROLE_REJECTED", "Decision finalized: APPROVE"

Number of calls: 1
