[Killed] BooleanLiteral
src/middleware/auth.js:8:13
     try {
         const authHeader = req.headers.authorization;
 
-        if (!authHeader) {
+        if (authHeader) {
             return res.status(401).json({ error: "Authentication required" });
         }
killedBy: Auth Middleware - Full Coverage should return 401 when no Authorization header
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"error": "Authentication required"}
Received: {"error": "Invalid or expired token"}

Number of calls: 1

[Killed] ConditionalExpression
src/middleware/auth.js:8:13
     try {
         const authHeader = req.headers.authorization;
 
-        if (!authHeader) {
+        if (false) {
             return res.status(401).json({ error: "Authentication required" });
         }
killedBy: Auth Middleware - Full Coverage should return 401 when no Authorization header
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"error": "Authentication required"}
Received: {"error": "Invalid or expired token"}

Number of calls: 1

[Killed] ObjectLiteral
src/middleware/auth.js:9:41
         const authHeader = req.headers.authorization;
 
         if (!authHeader) {
-            return res.status(401).json({ error: "Authentication required" });
+            return res.status(401).json({});
         }
 
killedBy: Auth Middleware - Full Coverage should return 401 when no Authorization header
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"error": "Authentication required"}
Received: {}

Number of calls: 1

[Killed] BlockStatement
src/middleware/auth.js:34:13
         }
 
         let decoded;
-        try {
-            decoded = jwt.verify(token, process.env.JWT_SECRET);
-        // Stryker disable next-line all
-        } catch (err) {
+        try {} catch (err) {
             // Stryker disable next-line all
             return res.status(401).json({ error: "Invalid or expired token" });
killedBy: App Boundary Conditions Coverage: Should hit index.js protected route
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] BlockStatement
src/middleware/auth.js:37:23
         try {
             decoded = jwt.verify(token, process.env.JWT_SECRET);
         // Stryker disable next-line all
-        } catch (err) {
-            // Stryker disable next-line all
-            return res.status(401).json({ error: "Invalid or expired token" });
-        }
+        } catch (err) {}
 
         // Stryker disable next-line all,OptionalChaining
killedBy: Auth Middleware - Catch & Fallback Precision should cleanly catch token verification errors and return a explicit 401 json structure
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "error": "Invalid or expired token",
+   "error": "Invalid token payload",

[Killed] ObjectLiteral
src/middleware/auth.js:44:41
 
         // Stryker disable next-line all,OptionalChaining
         if (!decoded?.id) {
-            return res.status(401).json({ error: "Invalid token payload" });
+            return res.status(401).json({});
         }
 
killedBy: Auth Middleware - Full Coverage should return 401 when JWT payload has no id (line 48)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"error": "Invalid token payload"}
Received: {}

Number of calls: 1

[Killed] ObjectLiteral
src/middleware/auth.js:51:41
 
         // Stryker disable next-line all
         if (!user) {
-            return res.status(401).json({ error: "User not found" });
+            return res.status(401).json({});
         }
 
killedBy: Auth Middleware - Full Coverage should return 401 when user not found in DB
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"error": "User not found"}
Received: {}

Number of calls: 1

[Killed] BlockStatement
src/middleware/auth.js:77:19
 
         next();
 
-    } catch (err) {
-        return res.status(401).json({ error: "Invalid or expired token" });
-    }
+    } catch (err) {}
 };
 
killedBy: Auth Middleware - Full Coverage should return 401 when DB throws (line 81 outer catch)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 401

Number of calls: 0
