[Killed] ObjectLiteral
src/controllers/adminController.js:132:37
 
         await auditService.logAuditTrail(adminId, userId, auditAction, `Decision finalized: ${action}`);
 
-        return res.status(200).json({
-            message: `Role change ${action.toLowerCase()}ed successfully.`
-        });
+        return res.status(200).json({});
 
     } catch (error) {
killedBy: Admin Controller - SSDLC Clean Suite approveRole should approve: call DB, log ROLE_APPROVED with exact string, return exact message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "Role change approveed successfully.",
- }

[Killed] MethodExpression
src/controllers/adminController.js:133:37
         await auditService.logAuditTrail(adminId, userId, auditAction, `Decision finalized: ${action}`);
 
         return res.status(200).json({
-            message: `Role change ${action.toLowerCase()}ed successfully.`
+            message: `Role change ${action.toUpperCase()}ed successfully.`
         });
 
killedBy: Admin Controller - SSDLC Clean Suite approveRole should approve: call DB, log ROLE_APPROVED with exact string, return exact message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Role change approveed successfully.",
+   "message": "Role change APPROVEed successfully.",

[Killed] BlockStatement
src/controllers/adminController.js:148:55
  * so that an empty array [] is treated as a valid 200 response, while
  * a genuine null return (mocked) correctly yields 404.
  */
-export const getRolePermissions = async (req, res) => {
-    try {
-        const { id } = req.params;
-
-        const permissions = await roleService.getPermissionsByRole(id);
-
-        if (permissions === null || permissions === undefined) {
-            return res.status(404).json({ error: "Permissions not found for this role" });
-        }
-
-        return res.status(200).json(permissions);
-    } catch (error) {
-        return res.status(500).json({ error: "Could not retrieve permissions" });
-    }
-};
+export const getRolePermissions = async (req, res) => {};
 
 export const updateUserSettings = updateUser;
killedBy: Admin Controller - SSDLC Clean Suite getRolePermissions should return 200 with permissions array
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] BlockStatement
src/controllers/adminController.js:149:9
  * a genuine null return (mocked) correctly yields 404.
  */
 export const getRolePermissions = async (req, res) => {
-    try {
-        const { id } = req.params;
-
-        const permissions = await roleService.getPermissionsByRole(id);
-
-        if (permissions === null || permissions === undefined) {
-            return res.status(404).json({ error: "Permissions not found for this role" });
-        }
-
-        return res.status(200).json(permissions);
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({ error: "Could not retrieve permissions" });
     }
killedBy: Admin Controller - SSDLC Clean Suite getRolePermissions should return 200 with permissions array
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] EqualityOperator
src/controllers/adminController.js:154:37
 
         const permissions = await roleService.getPermissionsByRole(id);
 
-        if (permissions === null || permissions === undefined) {
+        if (permissions === null || permissions !== undefined) {
             return res.status(404).json({ error: "Permissions not found for this role" });
         }
killedBy: Admin Controller - SSDLC Clean Suite getRolePermissions should return 200 with permissions array
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 404

Number of calls: 1

[Killed] ConditionalExpression
src/controllers/adminController.js:154:13
 
         const permissions = await roleService.getPermissionsByRole(id);
 
-        if (permissions === null || permissions === undefined) {
+        if (true) {
             return res.status(404).json({ error: "Permissions not found for this role" });
         }
killedBy: Admin Controller - SSDLC Clean Suite getRolePermissions should return 200 with permissions array
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 404

Number of calls: 1

[Killed] StringLiteral
src/controllers/adminController.js:155:50
         const permissions = await roleService.getPermissionsByRole(id);
 
         if (permissions === null || permissions === undefined) {
-            return res.status(404).json({ error: "Permissions not found for this role" });
+            return res.status(404).json({ error: "" });
         }
 
killedBy: Admin Controller - SSDLC Clean Suite getRolePermissions should return 404 with exact error when service returns null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "error": "Permissions not found for this role",
+   "error": "",

[Killed] BlockStatement
src/controllers/adminController.js:159:21
         }
 
         return res.status(200).json(permissions);
-    } catch (error) {
-        return res.status(500).json({ error: "Could not retrieve permissions" });
-    }
+    } catch (error) {}
 };
 
killedBy: Admin Controller - SSDLC Clean Suite getRolePermissions should return 500 with exact error on service crash
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0
