[Killed] StringLiteral
src/middleware/rbac.js:34:9
     auditService.logAuditTrail(
         user.id,
         'SYSTEM',
-        'UNAUTHORIZED_ADMIN_ACCESS',
+        "",
         `Denied attempt to access ${req.originalUrl}`
      ).catch(err => {
killedBy: RBAC Middleware - FULL COVERAGE RBAC - Stryker Mutant Elimination Suite authorizeAdmin should log exact originalUrl in audit trail
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "u5", "SYSTEM", "UNAUTHORIZED_ADMIN_ACCESS", "Denied attempt to access /api/admin/secret"
Received: "u5", "SYSTEM", "", "Denied attempt to access /api/admin/secret"

Number of calls: 1

[Killed] BlockStatement
src/middleware/rbac.js:36:21
         'SYSTEM',
         'UNAUTHORIZED_ADMIN_ACCESS',
         `Denied attempt to access ${req.originalUrl}`
-     ).catch(err => {
-        console.error('Audit log failed:', err);
-    });
+     ).catch(err => {});
 
     return res.status(403).json({ error: "Access denied. Admin privileges required." });
killedBy: RBAC Middleware - FULL COVERAGE RBAC Middleware - Inactive Blocks & Auditing should log error when audit trail promise rejects without crashing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Audit log failed:", Any<Error>

Number of calls: 0

[Killed] StringLiteral
src/middleware/rbac.js:37:23
         'UNAUTHORIZED_ADMIN_ACCESS',
         `Denied attempt to access ${req.originalUrl}`
      ).catch(err => {
-        console.error('Audit log failed:', err);
+        console.error("", err);
     });
 
killedBy: RBAC Middleware - FULL COVERAGE RBAC Middleware - Inactive Blocks & Auditing should log error when audit trail promise rejects without crashing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Audit log failed:", Any<Error>
Received: "", [Error: Audit DB Down]

Number of calls: 1

[Killed] BooleanLiteral
src/middleware/rbac.js:51:9
  * Returns 401 when no user present, 403 for permission failures.
  */
 export const authorize = (requiredPermission) => (req, res, next) => {
-    if (!requiredPermission || typeof requiredPermission !== 'string') {
+    if (requiredPermission || typeof requiredPermission !== 'string') {
         return res.status(403).json({ error: "System configuration error" });
     }
killedBy: RBAC Middleware - FULL COVERAGE authorize() blocks unauthenticated user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 401
Received: 403

Number of calls: 1

[Killed] BlockStatement
src/middleware/rbac.js:51:72
  * Returns 401 when no user present, 403 for permission failures.
  */
 export const authorize = (requiredPermission) => (req, res, next) => {
-    if (!requiredPermission || typeof requiredPermission !== 'string') {
-        return res.status(403).json({ error: "System configuration error" });
-    }
+    if (!requiredPermission || typeof requiredPermission !== 'string') {}
 
     const user = req.user;
killedBy: RBAC Middleware - FULL COVERAGE authorize() rejects missing permission string
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 403
Received: 401

Number of calls: 1

[Killed] StringLiteral
src/middleware/rbac.js:52:46
  */
 export const authorize = (requiredPermission) => (req, res, next) => {
     if (!requiredPermission || typeof requiredPermission !== 'string') {
-        return res.status(403).json({ error: "System configuration error" });
+        return res.status(403).json({ error: "" });
     }
 
killedBy: RBAC Middleware - FULL COVERAGE RBAC Middleware - Precision Mutant Elimination should strictly enforce exact response structure on missing system configuration arguments
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "error": "System configuration error",
+   "error": "",

[Killed] BlockStatement
src/middleware/rbac.js:62:25
         return res.status(401).json({ error: "Unauthorized. Please log in." });
     }
 
-    if (!user.isActive) {
-        return res.status(403).json({ error: "Access denied. Account inactive." });
-    }
+    if (!user.isActive) {}
 
     // Stryker disable next-line all
killedBy: RBAC Middleware - FULL COVERAGE authorize() blocks inactive user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 403

Number of calls: 0

[Killed] ConditionalExpression
src/middleware/rbac.js:62:9
         return res.status(401).json({ error: "Unauthorized. Please log in." });
     }
 
-    if (!user.isActive) {
+    if (false) {
         return res.status(403).json({ error: "Access denied. Account inactive." });
     }
killedBy: RBAC Middleware - FULL COVERAGE authorize() blocks inactive user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 403

Number of calls: 0

[Killed] ObjectLiteral
src/middleware/rbac.js:63:37
     }
 
     if (!user.isActive) {
-        return res.status(403).json({ error: "Access denied. Account inactive." });
+        return res.status(403).json({});
     }
 
killedBy: RBAC Middleware - FULL COVERAGE RBAC Middleware - Inactive Blocks & Auditing should explicitly deny inactive users with the exact message layout
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "error": "Access denied. Account inactive.",
- }

[Killed] ConditionalExpression
src/middleware/rbac.js:74:13
     // Stryker disable next-line all
     if (!allowed) {
         auditService.logAuditTrail(
-            user.id || 'Anonymous',
+            false,
             'SYSTEM',
             'PERMISSION_DENIED',
killedBy: RBAC Middleware - FULL COVERAGE authorize() anonymous fallback audit ID
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Anonymous", "SYSTEM", "PERMISSION_DENIED", Any<String>
Received: false, "SYSTEM", "PERMISSION_DENIED", "Missing permission: admin:write"

Number of calls: 1

[Killed] ConditionalExpression
src/middleware/rbac.js:74:13
     // Stryker disable next-line all
     if (!allowed) {
         auditService.logAuditTrail(
-            user.id || 'Anonymous',
+            true,
             'SYSTEM',
             'PERMISSION_DENIED',
killedBy: RBAC Middleware - FULL COVERAGE authorize() anonymous fallback audit ID
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Anonymous", "SYSTEM", "PERMISSION_DENIED", Any<String>
Received: true, "SYSTEM", "PERMISSION_DENIED", "Missing permission: admin:write"

Number of calls: 1

[Killed] StringLiteral
src/middleware/rbac.js:77:13
             user.id || 'Anonymous',
             'SYSTEM',
             'PERMISSION_DENIED',
-            `Missing permission: ${requiredPermission}`
+            ``
         ).catch(/* istanbul ignore next */() => {});
 
killedBy: RBAC Middleware - FULL COVERAGE RBAC - Stryker Mutant Elimination Suite authorize should log exact permission name in audit trail
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "u4", "SYSTEM", "PERMISSION_DENIED", "Missing permission: delete:all"
Received: "u4", "SYSTEM", "PERMISSION_DENIED", ""

Number of calls: 1
