[Killed] BlockStatement
src/services/oauth.service.js:5:38
 import jwt from 'jsonwebtoken';
 
 export const OAuthService = {
-    generateAuthUrl(provider, state) {
-        return `https://accounts.provider.com/o/oauth2/v2/auth?client_id=XYZ&response_type=code&state=${state}`;
-    },
+    generateAuthUrl(provider, state) {},
     async exchangeCodeForTokens(provider, code) {
         const response = { access_token: 'provider_secret_token_abc123', email: 'user@example.com', sub: 'idp_12345' };
killedBy: OAuth Service - Core Business Logic & Security Suite generateAuthUrl should return a string URL
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "string"
Received: "undefined"

[Killed] BlockStatement
src/services/oauth.service.js:8:49
     generateAuthUrl(provider, state) {
         return `https://accounts.provider.com/o/oauth2/v2/auth?client_id=XYZ&response_type=code&state=${state}`;
     },
-    async exchangeCodeForTokens(provider, code) {
-        const response = { access_token: 'provider_secret_token_abc123', email: 'user@example.com', sub: 'idp_12345' };
-        return response;
-    },
+    async exchangeCodeForTokens(provider, code) {},
     async processUserSignIn(provider, providerData) {
         const { email, sub } = providerData;
killedBy: OAuth Service - Core Business Logic & Security Suite exchangeCodeForTokens should return an object with access_token, email, and sub
statusReason: Error: expect(received).toHaveProperty(path)

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] BlockStatement
src/services/oauth.service.js:19:16
         // Stryker disable next-line all
         /* istanbul ignore next */ if (linkedAccount) {
             internalUser = await findUserById(linkedAccount.userId);
-        } else {
-            internalUser = await findUserByEmail(email);
-            // Stryker disable next-line all
-            /* istanbul ignore next */ if (internalUser) {
-                await createOAuthLink(internalUser.id, provider, sub, email);
-            } else {
-                // Stryker disable next-line all
-                internalUser = await createNewUser({ email, role: 'USER', isActive: true });
-                // Stryker disable next-line all
-                await createOAuthLink(internalUser.id, provider, sub, email);
-            }
-        }
+        } else {}
         // Stryker disable next-line all
         if (internalUser.isActive === false || internalUser.status === 'DEACTIVATED') {
killedBy: OAuth Service - Core Business Logic & Security Suite OAuth Service - Deep Structural Branch Validation should execute the true branch of auto-provisioning links when accounts match
statusReason: TypeError: Cannot read properties of null (reading 'isActive')

[Killed] BlockStatement
src/services/oauth.service.js:24:20
             // Stryker disable next-line all
             /* istanbul ignore next */ if (internalUser) {
                 await createOAuthLink(internalUser.id, provider, sub, email);
-            } else {
-                // Stryker disable next-line all
-                internalUser = await createNewUser({ email, role: 'USER', isActive: true });
-                // Stryker disable next-line all
-                await createOAuthLink(internalUser.id, provider, sub, email);
-            }
+            } else {}
         }
         // Stryker disable next-line all
killedBy: OAuth Service - Core Business Logic & Security Suite OAuth Service - Deep Structural Branch Validation should execute the true branch of auto-provisioning links when accounts match
statusReason: TypeError: Cannot read properties of null (reading 'isActive')

[Killed] BooleanLiteral
src/services/oauth.service.js:33:33
         }
         // Stryker disable next-line all
         if (internalUser.isActive === false || internalUser.status === 'DEACTIVATED') {
-            return { isBlocked: true };
+            return { isBlocked: false };
         }
         const token = jwt.sign(
killedBy: OAuth Service - Core Business Logic & Security Suite processUserSignIn should return isBlocked:true when provisioned user is inactive
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/services/oauth.service.js:37:13
         }
         const token = jwt.sign(
             { id: internalUser.id, role: internalUser.role },
-            process.env.JWT_SECRET || 'dev_backup_secret',
+            true,
             { expiresIn: '1h' }
         );
killedBy: OAuth Service - Core Business Logic & Security Suite OAuth Service - Deep Structural Branch Validation should execute the true branch of auto-provisioning links when accounts match
statusReason: Error: secretOrPrivateKey is not valid key material

[Killed] ConditionalExpression
src/services/oauth.service.js:37:13
         }
         const token = jwt.sign(
             { id: internalUser.id, role: internalUser.role },
-            process.env.JWT_SECRET || 'dev_backup_secret',
+            false,
             { expiresIn: '1h' }
         );
killedBy: OAuth Service - Core Business Logic & Security Suite OAuth Service - Deep Structural Branch Validation should execute the true branch of auto-provisioning links when accounts match
statusReason: Error: secretOrPrivateKey must have a value

[Killed] LogicalOperator
src/services/oauth.service.js:42:13
         );
         const refreshToken = jwt.sign(
             { id: internalUser.id },
-            process.env.JWT_REFRESH_SECRET || 'dev_backup_refresh',
+            process.env.JWT_REFRESH_SECRET && 'dev_backup_refresh',
             { expiresIn: '7d' }
         );
killedBy: OAuth Service - Core Business Logic & Security Suite processUserSignIn should issue refresh token verifiable with JWT_REFRESH_SECRET
statusReason: Error: expect(received).not.toThrow()

Error name:    "JsonWebTokenError"
Error message: "invalid signature"

      197 |             const result = await OAuthService.processUserSignIn('google', providerData);
      198 |             expect(() =>
    > 199 |                 jwt.verify(result.refreshToken, process.env.JWT_REFRESH_SECRET)

[Killed] ConditionalExpression
src/services/oauth.service.js:42:13
         );
         const refreshToken = jwt.sign(
             { id: internalUser.id },
-            process.env.JWT_REFRESH_SECRET || 'dev_backup_refresh',
+            true,
             { expiresIn: '7d' }
         );
killedBy: OAuth Service - Core Business Logic & Security Suite OAuth Service - Deep Structural Branch Validation should execute the true branch of auto-provisioning links when accounts match
statusReason: Error: secretOrPrivateKey is not valid key material

[Killed] ObjectLiteral
src/services/oauth.service.js:45:16
             process.env.JWT_REFRESH_SECRET || 'dev_backup_refresh',
             { expiresIn: '7d' }
         );
-        return { token, refreshToken, user: { id: internalUser.id, role: internalUser.role, email: internalUser.email } };
+        return {};
     },
     // Stryker disable next-line all
killedBy: OAuth Service - Core Business Logic & Security Suite OAuth Service - Deep Structural Branch Validation should execute the true branch of auto-provisioning links when accounts match
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "token"
Received path: []

Received value: {}

[Killed] ObjectLiteral
src/services/oauth.service.js:45:45
             process.env.JWT_REFRESH_SECRET || 'dev_backup_refresh',
             { expiresIn: '7d' }
         );
-        return { token, refreshToken, user: { id: internalUser.id, role: internalUser.role, email: internalUser.email } };
+        return { token, refreshToken, user: {} };
     },
     // Stryker disable next-line all
killedBy: OAuth Service - Core Business Logic & Security Suite processUserSignIn should return user object with id, role, and email fields
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "id"
Received path: []

Received value: {}

[Killed] BlockStatement
src/services/oauth.service.js:50:58
     // Stryker disable next-line all
     /* istanbul ignore next */
     async blocklistToken(t) { return true; },
-    async revokeSessionTokens(accessToken, refreshToken) {
-        await OAuthService.blocklistToken(accessToken);
-        await OAuthService.blocklistToken(refreshToken);
-    }
+    async revokeSessionTokens(accessToken, refreshToken) {}
 };
 
killedBy: OAuth Service - Core Business Logic & Security Suite OAuth Service - Deep Structural Branch Validation should call internal token blocklisting twice when revoking session tokens
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0
