[Killed] BlockStatement
src/services/roleService.js:3:37
 import { PERMISSION_MATRIX } from '../config/permissions.js';
 
-const getNormalizedRole = (role) => {
-    // Stryker disable next-line ConditionalExpression,StringLiteral
-    if (!role) return '';
-    // Stryker disable next-line ConditionalExpression,StringLiteral
-    return typeof role === 'string' ? role.toUpperCase() : String(role).toUpperCase();
-};
+const getNormalizedRole = (role) => {};
 
 export const roleService = {
killedBy: Role Service - Production Grade Coverage Suite ADMIN role resolution should return full permission set for ADMIN
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ArrayContaining ["all:all", "manage:users", "view:logs", "manage:roles", "approve:roles"]
Received: []

[Timeout] BooleanLiteral
src/services/roleService.js:5:9
 
 const getNormalizedRole = (role) => {
     // Stryker disable next-line ConditionalExpression,StringLiteral
-    if (!role) return '';
+    if (role) return '';
     // Stryker disable next-line ConditionalExpression,StringLiteral
     return typeof role === 'string' ? role.toUpperCase() : String(role).toUpperCase();

[Timeout] MethodExpression
src/services/roleService.js:7:60
     // Stryker disable next-line ConditionalExpression,StringLiteral
     if (!role) return '';
     // Stryker disable next-line ConditionalExpression,StringLiteral
-    return typeof role === 'string' ? role.toUpperCase() : String(role).toUpperCase();
+    return typeof role === 'string' ? role.toUpperCase() : String(role).toLowerCase();
 };
 

[Timeout] EqualityOperator
src/services/roleService.js:7:12
     // Stryker disable next-line ConditionalExpression,StringLiteral
     if (!role) return '';
     // Stryker disable next-line ConditionalExpression,StringLiteral
-    return typeof role === 'string' ? role.toUpperCase() : String(role).toUpperCase();
+    return typeof role !== 'string' ? role.toUpperCase() : String(role).toUpperCase();
 };
 

[Killed] ObjectLiteral
src/services/roleService.js:10:28
     return typeof role === 'string' ? role.toUpperCase() : String(role).toUpperCase();
 };
 
-export const roleService = {
-    getPermissionsByRole: async (role) => {
-        const normalized = getNormalizedRole(role);
-        return PERMISSION_MATRIX[normalized] || [];
-    },
-
-    checkPermission: (role, permission) => {
-        if (!role || !permission) return false;
-
-        const normalized = getNormalizedRole(role);
-        /* istanbul ignore next */
-        const perms = PERMISSION_MATRIX[normalized] || [];
-
-        return perms.includes(permission) || perms.includes('all:all');
-    },
-
-    validateRole: (role) => {
-        const normalized = getNormalizedRole(role);
-        return Object.prototype.hasOwnProperty.call(PERMISSION_MATRIX, normalized);
-    },
-};
+export const roleService = {};
 
 export default roleService;
killedBy: Role Service - Production Grade Coverage Suite ADMIN role resolution should return full permission set for ADMIN
statusReason: TypeError: roleService.getPermissionsByRole is not a function

[Killed] BlockStatement
src/services/roleService.js:11:43
 };
 
 export const roleService = {
-    getPermissionsByRole: async (role) => {
-        const normalized = getNormalizedRole(role);
-        return PERMISSION_MATRIX[normalized] || [];
-    },
+    getPermissionsByRole: async (role) => {},
 
     checkPermission: (role, permission) => {
killedBy: Role Service - Production Grade Coverage Suite ADMIN role resolution should return full permission set for ADMIN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/services/roleService.js:13:16
 export const roleService = {
     getPermissionsByRole: async (role) => {
         const normalized = getNormalizedRole(role);
-        return PERMISSION_MATRIX[normalized] || [];
+        return false;
     },
 
killedBy: Role Service - Production Grade Coverage Suite ADMIN role resolution should return full permission set for ADMIN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/services/roleService.js:13:16
 export const roleService = {
     getPermissionsByRole: async (role) => {
         const normalized = getNormalizedRole(role);
-        return PERMISSION_MATRIX[normalized] || [];
+        return PERMISSION_MATRIX[normalized] && [];
     },
 
killedBy: Role Service - Production Grade Coverage Suite ADMIN role resolution should return full permission set for ADMIN
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ArrayContaining ["all:all", "manage:users", "view:logs", "manage:roles", "approve:roles"]
Received: []

[Killed] BlockStatement
src/services/roleService.js:16:44
         return PERMISSION_MATRIX[normalized] || [];
     },
 
-    checkPermission: (role, permission) => {
-        if (!role || !permission) return false;
-
-        const normalized = getNormalizedRole(role);
-        /* istanbul ignore next */
-        const perms = PERMISSION_MATRIX[normalized] || [];
-
-        return perms.includes(permission) || perms.includes('all:all');
-    },
+    checkPermission: (role, permission) => {},
 
     validateRole: (role) => {
killedBy: Role Service - Production Grade Coverage Suite roleService Custom Edge Cases (Killing Remaining Mutants) should handle falsy inputs gracefully across all methods
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] ConditionalExpression
src/services/roleService.js:17:13
     },
 
     checkPermission: (role, permission) => {
-        if (!role || !permission) return false;
+        if (false) return false;
 
         const normalized = getNormalizedRole(role);
killedBy: Role Service - Production Grade Coverage Suite roleService Custom Edge Cases (Killing Remaining Mutants) should handle falsy inputs gracefully across all methods
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/services/roleService.js:17:13
     },
 
     checkPermission: (role, permission) => {
-        if (!role || !permission) return false;
+        if (true) return false;
 
         const normalized = getNormalizedRole(role);
killedBy: Role Service - Production Grade Coverage Suite roleService Custom Edge Cases (Killing Remaining Mutants) should fall back to wildcard all:all check when explicit permission is missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/services/roleService.js:21:23
 
         const normalized = getNormalizedRole(role);
         /* istanbul ignore next */
-        const perms = PERMISSION_MATRIX[normalized] || [];
+        const perms = PERMISSION_MATRIX[normalized] && [];
 
         return perms.includes(permission) || perms.includes('all:all');
killedBy: Role Service - Production Grade Coverage Suite roleService Custom Edge Cases (Killing Remaining Mutants) should fall back to wildcard all:all check when explicit permission is missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/services/roleService.js:21:23
 
         const normalized = getNormalizedRole(role);
         /* istanbul ignore next */
-        const perms = PERMISSION_MATRIX[normalized] || [];
+        const perms = true;
 
         return perms.includes(permission) || perms.includes('all:all');
killedBy: Role Service - Production Grade Coverage Suite roleService Custom Edge Cases (Killing Remaining Mutants) should properly cast and upscale non-string types and lower-case roles
statusReason: TypeError: perms.includes is not a function

[Killed] ConditionalExpression
src/services/roleService.js:23:16
         /* istanbul ignore next */
         const perms = PERMISSION_MATRIX[normalized] || [];
 
-        return perms.includes(permission) || perms.includes('all:all');
+        return false;
     },
 
killedBy: Role Service - Production Grade Coverage Suite roleService Custom Edge Cases (Killing Remaining Mutants) should fall back to wildcard all:all check when explicit permission is missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/services/roleService.js:23:16
         /* istanbul ignore next */
         const perms = PERMISSION_MATRIX[normalized] || [];
 
-        return perms.includes(permission) || perms.includes('all:all');
+        return true;
     },
 
killedBy: Role Service - Production Grade Coverage Suite roleService - Precision Mutant Elimination Type Normalization Checks (Line 5) should explicitly exercise both sides of the string type branch using custo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/services/roleService.js:26:29
         return perms.includes(permission) || perms.includes('all:all');
     },
 
-    validateRole: (role) => {
-        const normalized = getNormalizedRole(role);
-        return Object.prototype.hasOwnProperty.call(PERMISSION_MATRIX, normalized);
-    },
+    validateRole: (role) => {},
 };
 
killedBy: Role Service - Production Grade Coverage Suite roleService Custom Edge Cases (Killing Remaining Mutants) should handle falsy inputs gracefully across all methods
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined
