[Killed] ConditionalExpression
src/services/provisioning.service.js:12:7
   } = claims;
 
   // 1. Enforce Email Verification
-  if (email_verified === false) {
+  if (false) {
     throw new Error("Email must be verified by OAuth provider");
   }
killedBy: ATS User Provisioning & Profile Mapping Security: should throw error if email is not verified
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Email must be verified by OAuth provider"

Received function did not throw

[Killed] BlockStatement
src/services/provisioning.service.js:17:69
   }
 
   // 2. Enforce Domain/Tenant Restrictions (if configured)
-  if (config.allowedDomains && !config.allowedDomains.includes(hd)) {
-    throw new Error("Domain not authorized");
-  }
+  if (config.allowedDomains && !config.allowedDomains.includes(hd)) {}
 
   // 3. Reliable Matching (Email/Provider ID rules)
killedBy: ATS User Provisioning & Profile Mapping Security: should throw error if domain is unauthorized
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Domain not authorized"

Received function did not throw

[Killed] ConditionalExpression
src/services/provisioning.service.js:22:33
   }
 
   // 3. Reliable Matching (Email/Provider ID rules)
-  let user = database.find(u => u.providerId === sub || u.email === email);
+  let user = database.find(u => false);
 
   if (user) {
killedBy: ATS User Provisioning & Profile Mapping Existing User: should match by providerId and set isNewUser=false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1"
Received: "user_1779902914658"

[Killed] ConditionalExpression
src/services/provisioning.service.js:22:33
   }
 
   // 3. Reliable Matching (Email/Provider ID rules)
-  let user = database.find(u => u.providerId === sub || u.email === email);
+  let user = database.find(u => false || u.email === email);
 
   if (user) {
killedBy: ATS User Provisioning & Profile Mapping Reliability: should match by providerId even if email has changed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1"
Received: "user_1779902915106"

[Killed] ConditionalExpression
src/services/provisioning.service.js:37:13
       email: email,
       name: name,
       profileImage: picture,
-      role: config.defaultRole || 'Candidate', // [Requirement: correct default role]
+      role: false, // [Requirement: correct default role]
       isNewUser: true // [Requirement: First-time login onboarding flag]
     };
killedBy: ATS User Provisioning & Profile Mapping New User: should provision with "Candidate" role and isNewUser=true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Candidate"
Received: false
